{
  "nombre": "Señales y Aprendizaje Automático",
  "descripcion": "Perfil de Señales y Aprendizaje Automático enfocado en procesamiento de señales, sistemas, y técnicas de aprendizaje automático",
  "materias_core": ["SyS", "FAAPRP", "SyC", "SalMod"],
  "materias_optativas": ["OpSenales", "OpAA", "OpTelec", "OpInf", "OpElectro", "OpDigit"],
  "materias_sugeridas": [],
  "notas_importantes": [
    {
      "id": "fisica_matematicas",
      "titulo": "Asignaturas de Física y Matemáticas",
      "descripcion": "Prácticamente todas las asignaturas de las materias Física y Matemáticas pueden cursarse en Facultad de Ciencias, en el marco de las Licenciaturas de Física y Matemática. Existen algunas reválidas automáticas aprobadas por la Facultad."
    },
    {
      "id": "matematica_inicial",
      "titulo": "Matemática Inicial",
      "descripcion": "Curso fuertemente recomendado al comienzo de la carrera en función del resultado de la Prueba Diagnóstica al Ingreso."
    },
    {
      "id": "tallerine",
      "titulo": "Taller de Introducción a la Ingeniería Eléctrica",
      "descripcion": "Sin ser obligatorio, el TallerInE es fuertemente recomendado en el semestre de ingreso. Se dicta en ambos semestres. Alternativas: Taller de Diseño, Comunicación y Representación Gráfica, Módulos de Extensión o Módulos de Taller."
    },
    {
      "id": "formacion_basica",
      "titulo": "Formación Básica",
      "descripcion": "Se deben cubrir al menos 160 créditos en áreas de formación básica (Física + Matemática + Química). Opcionales: Física Térmica, Vibraciones y Ondas, Óptica, Principios de Química General, Introducción a la Física Moderna, Matemática Discreta."
    },
    {
      "id": "pasantia",
      "titulo": "Pasantía",
      "descripcion": "La Pasantía es una actividad fuertemente recomendada para todos los alumnos y puede ser realizada en cualquier semestre, incluso fuera del periodo de clases."
    },
    {
      "id": "ingenieria_industrial",
      "titulo": "Ingeniería Industrial",
      "descripcion": "Se debe cubrir un mínimo de 5 créditos en el área de Ingeniería Industrial. Opciones: Administración General para Ingenieros, Control de Calidad, Costos para Ingeniería, Introducción a la Ingeniería Industrial, Investigación de Operaciones, Prevención de Riesgos Laborales, Práctica de Administración."
    },
    {
      "id": "ingenieria_sociedad",
      "titulo": "Ingeniería y Sociedad",
      "descripcion": "Se deben cubrir al menos 5 créditos en el área de Ingeniería y Sociedad. Opciones: Ciencia, Tecnología y Sociedad, Cooperativismo, Historia del Uruguay Contemporáneo, Módulos de Extensión."
    },
    {
      "id": "opcionales_senales",
      "titulo": "Opcionales de Señales",
      "descripcion": "Opciones: Introducción a la Teoría de la Información, Tratamiento de Imágenes por Computadora, Procesamiento Digital de Señales de Audio, Optimización Bajo Incertidumbre, Estimación y Predicción en Series Temporales, Herramientas de representación tiempo-frecuencia, Aplicaciones de la Teoría de la Información al Procesamiento de Imágenes, Teoría de Códigos Avanzados."
    },
    {
      "id": "opcionales_aprendizaje",
      "titulo": "Opcionales de Aprendizaje Automático",
      "descripcion": "Opciones: Taller de Aprendizaje Automático, Aprendizaje Profundo para Visión Artificial, Aprendizaje profundo para el análisis de imágenes biomédicas, Herramientas de aprendizaje automático."
    },
    {
      "id": "opcionales_telecomunicaciones",
      "titulo": "Opcionales de Telecomunicaciones",
      "descripcion": "Opciones: Redes de datos 2, Comunicaciones Inalámbricas, Tecnologías de Redes y Servicios de Telecomunicaciones, Redes de acceso, Distribución y aplicaciones multimedia, Digitalización y codificación multimedia, Redes ópticas, Códigos para corrección de errores."
    }
  ],
  "plan_recomendado": {
    "1": ["CDIV", "GAL1", "F1", "Tallerine", "MI"],
    "2": ["CDIVV", "GAL2", "F2", "P1"],
    "3": ["CVec", "PyE", "F3", "MecNewt", "FExp1"],
    "4": ["EcuDif", "ElecMag", "FExp2", "TeoCirc", "DisLog"],
    "5": ["FVC", "SyS", "IntroMicro", "PIE", "ElecFund"],
    "6": ["MetNum", "SyC", "TFourier", "SalMod", "FAAPRP"],
    "7": ["MedElect", "OpAA", "OpBasica", "OpSenales", "OpTelec"],
    "8": ["Pas", "Redes1", "OpSenales", "OpInf", "OpElectro"],
    "9": ["ProyFin10", "OpInd", "Electro", "OpSenalesAA", "OpSenales"],
    "10": ["ProyFin25", "LRI", "InstEl", "Ec", "OpIyS"]
  }
}
